# Lab 4

In [14]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [15]:
import pandas
import configparser
import psycopg2

In [16]:
config = configparser.ConfigParser()
config.read('config.ini')

['config.ini']

In [17]:
host = config ['myaws']['host']
user = config ['myaws']['user']
pwd= config ['myaws']['pwd']
database = config ['myaws']['database']

In [18]:
conn = psycopg2.connect(
                        host = host,
                        user = user,
                        password = pwd,
                        dbname = database

)

In [19]:
cur= conn.cursor()

##### Q1

In [20]:
sql_statement = '''
             select * from student_gp9mb
             '''

In [21]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,semail,sname,major
0,marysue@dukes.jmu.edu ...,Mary Sue ...,IA ...
1,johndoe@dukes.jmu.edu ...,John Doe ...,IA ...
2,bobsmith@dukes.jmu.edu ...,Bob Smith ...,IA ...
3,jackjones@dukes.jmu.edu ...,Jack Jones ...,IA ...
4,billyjoe@dukes.jmu.edu ...,Billy Joe ...,IA ...

##### Q2

In [22]:
sql_statement = '''
                select  
                cname, count (semail)
                from correlation_gp9mb
                group by cname
                order by count (semail) desc
                limit 1
            '''
# All SQL statements must be displayed as a string, and they can be read by pandas

In [23]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

                                               cname  count
0  IA261                                         ...      2

##### Q3

In [36]:
sql_statement2 = '''
                select
                *
                from teacher_gp9mb
                inner join course_gp9mb
                on teacher_gp9mb.temail = course_gp9mb.temail
            '''
df = pandas.read_sql_query(sql_statement2,conn)
df[:]

,temail,tname,office,cname,room,temail
0,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT116,IA 240 ...,ISAT301,moore8ka@jmu.edu ...
1,waltontr@jmu.edu ...,Timothy Walton ...,ISAT326,IA261 ...,ISAT350,waltontr@jmu.edu ...
2,taoqx@jmu.edu ...,Tom Tao ...,ENGEO2107,IA312 ...,ISAT215,taoqx@jmu.edu ...
3,weixx@jmu.edu ...,Xeubin Wei ...,ISAT112,IA340 ...,ENGEO2010,weixx@jmu.edu ...
4,grant@jmu.edu ...,Grant ...,123,IA321 ...,201,grant@jmu.edu ...
5,grant@jmu.edu ...,Grant ...,123,IA200 ...,ENGEO1204,grant@jmu.edu ...
6,grant@jmu.edu ...,Grant ...,123,IA300 ...,ENGEO1206,grant@jmu.edu ...

##### Q4

In [40]:
sql_statement3 = '''
                select
                teacher_gp9mb.tname as tname,
                count (course_gp9mb.cname) as course_num
                from teacher_gp9mb
                inner join course_gp9mb
                on teacher_gp9mb.temail = course_gp9mb.temail
                group by teacher_gp9mb.tname
                '''
df = pandas.read_sql_query(sql_statement3,conn)
df[:]

                                               tname  course_num
0  Timothy Walton                                ...           1
1  Kathleen Moore                                ...           1
2  Tom Tao                                       ...           1
3  Xeubin Wei                                    ...           1
4  Grant                                         ...           3

##### Q5

In [24]:
sql_insert_statement = '''
                        insert into teacher_gp9mb(temail,tname,office)
                        values('{}','{}','{}')
                        '''.format ('new_email','new_name','new_office')        # the values are strings, you DO need quotation marks. String means {}
print (sql_insert_statement)

                        insert into teacher_gp9mb(temail,tname,office)
                        values('new_email','new_name','new_office')

In [25]:
cur.execute(sql_insert_statement)

UniqueViolation: duplicate key value violates unique constraint "teacher_gp9mb_pkey"
DETAIL:  Key (temail)=(new_email                                                                                           ) already exists.

In [27]:
conn.commit()

In [30]:
df = pandas.read_sql_query('''select * from teacher_gp9mb''',conn)
df[:]

,temail,tname,office
0,weixx@jmu.edu ...,Xeubin Wei ...,ISAT112
1,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT116
2,waltontr@jmu.edu ...,Timothy Walton ...,ISAT326
3,taoqx@jmu.edu ...,Tom Tao ...,ENGEO2107
4,grant@jmu.edu ...,Grant ...,123
5,new_email ...,new_name ...,new_office

##### Q6

In [54]:
sql_statement4 = '''
                update course_gp9mb
                set temail = 'grant@jmu.edu'
                where temail = 'marrinsp@jmu.edu'
                '''

In [55]:
cur.execute(sql_statement4)

In [56]:
conn.commit()

In [64]:
df = pandas.read_sql_query('''select * from course_gp9mb''',conn)
df[:]

,cname,room,temail
0,IA 240 ...,ISAT301,moore8ka@jmu.edu ...
1,IA261 ...,ISAT350,waltontr@jmu.edu ...
2,IA312 ...,ISAT215,taoqx@jmu.edu ...
3,IA340 ...,ENGEO2010,weixx@jmu.edu ...
4,IA321 ...,201,grant@jmu.edu ...
5,IA200 ...,ENGEO1204,grant@jmu.edu ...
6,IA300 ...,ENGEO1206,grant@jmu.edu ...

In [67]:
sql_statement5= '''
                delete from teacher_gp9mb
                where temail = 'marrinsp@jmu.edu'
                '''

In [68]:
cur.execute(sql_statement5)

In [69]:
conn.commit()

In [70]:
df = pandas.read_sql_query('''select * from teacher_gp9mb''',conn)
df[:]

,temail,tname,office
0,weixx@jmu.edu ...,Xeubin Wei ...,ISAT112
1,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT116
2,waltontr@jmu.edu ...,Timothy Walton ...,ISAT326
3,taoqx@jmu.edu ...,Tom Tao ...,ENGEO2107
4,grant@jmu.edu ...,Grant ...,123
5,new_email ...,new_name ...,new_office